In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import Series, DataFrame

## 1. 데이터 프레임 생성

In [33]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = DataFrame(data)

In [34]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### head, tail

In [35]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [36]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### 피쳐 선택적으로 생성

In [37]:
DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

### 없는 피쳐 선택하면, 결측치로 생성됨

In [38]:
frame2 = DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

### 피쳐 확인, 피쳐별 데이터 호출

In [39]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [40]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [41]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [42]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

### 특정 피쳐 데이터는 Series객체이다.

In [43]:
type(frame2)

pandas.core.frame.DataFrame

In [44]:
type(frame2.year)

pandas.core.series.Series

## 2. 피쳐 수정

In [7]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [9]:
frame["debt"] = 16.5
frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2001  2.4  16.5
4  Nevada  2002  2.9  16.5
5  Nevada  2003  3.2  16.5

In [11]:
frame["debt"] = np.arange(6.)
frame

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    Ohio  2001  1.7   1.0
2    Ohio  2002  3.6   2.0
3  Nevada  2001  2.4   3.0
4  Nevada  2002  2.9   4.0
5  Nevada  2003  3.2   5.0

In [12]:
frame["state"] == "Ohio"

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [14]:
frame["eastern"] = frame["state"] == "Ohio"
frame

    state  year  pop  debt  eastern
0    Ohio  2000  1.5   0.0     True
1    Ohio  2001  1.7   1.0     True
2    Ohio  2002  3.6   2.0     True
3  Nevada  2001  2.4   3.0    False
4  Nevada  2002  2.9   4.0    False
5  Nevada  2003  3.2   5.0    False

In [18]:
val = Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
frame["debt"] = val
frame

    state  year  pop  debt  eastern
0    Ohio  2000  1.5   NaN     True
1    Ohio  2001  1.7   NaN     True
2    Ohio  2002  3.6   NaN     True
3  Nevada  2001  2.4   NaN    False
4  Nevada  2002  2.9   NaN    False
5  Nevada  2003  3.2   NaN    False

In [19]:
val = Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame["debt"] = val
frame

    state  year  pop  debt  eastern
0    Ohio  2000  1.5   NaN     True
1    Ohio  2001  1.7   NaN     True
2    Ohio  2002  3.6  -1.2     True
3  Nevada  2001  2.4   NaN    False
4  Nevada  2002  2.9  -1.5    False
5  Nevada  2003  3.2  -1.7    False

### 피쳐 삭제

In [21]:
del frame["eastern"]
frame.columns

Index(['state', 'year', 'pop', 'debt'], dtype='object')

In [22]:
frame.pop("debt")

0    NaN
1    NaN
2   -1.2
3    NaN
4   -1.5
5   -1.7
Name: debt, dtype: float64

In [23]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

## 3. 중첩된 dictionary를 활용한 DataFrame 생성

### 동일한 길이로 값이 이루어진 딕셔너리 -> DataFrame

In [24]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [25]:
DataFrame(data)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### 딕셔너리 리스트 -> DataFrame

In [26]:
data1={"state": "Ohio", 
        "year": 2000,
        "pop": 1.5}

data2={"state": "Mass", 
        "year": 2000,
        "GDP": 1.8}

data3={"year": 2011,
        "pop": 1.1}

In [27]:
DataFrame([data1,data2,data3])

  state  year  pop  GDP
0  Ohio  2000  1.5  NaN
1  Mass  2000  NaN  1.8
2   NaN  2011  1.1  NaN

### 중첩된 딕셔너리 -> DataFrame

In [52]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [53]:
frame3 = DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [50]:
DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

### 2차원 넘파이 배열 -> DataFrmae

In [30]:
arr=np.array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9],
       [2003, 'Nevada', 3.2]])
arr

array([['2000', 'Ohio', '1.5'],
       ['2001', 'Ohio', '1.7'],
       ['2002', 'Ohio', '3.6'],
       ['2001', 'Nevada', '2.4'],
       ['2002', 'Nevada', '2.9'],
       ['2003', 'Nevada', '3.2']], dtype='<U32')

In [31]:
D=DataFrame(arr)
D

      0       1    2
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [647]:
D.index=['a','b','c','d','e','f']

In [648]:
D.columns=['year','state','pop']

In [649]:
D

   year   state  pop
a  2000    Ohio  1.5
b  2001    Ohio  1.7
c  2002    Ohio  3.6
d  2001  Nevada  2.4
e  2002  Nevada  2.9
f  2003  Nevada  3.2

In [45]:
arr=np.array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9],
       [2003, 'Nevada', 3.2]])
D=DataFrame(arr,index=['a','b','c','d','e','f'],columns=['year','state','pop'])
D

   year   state  pop
a  2000    Ohio  1.5
b  2001    Ohio  1.7
c  2002    Ohio  3.6
d  2001  Nevada  2.4
e  2002  Nevada  2.9
f  2003  Nevada  3.2

## 4. name 속성

In [54]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [55]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [56]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

## 5. reindex (재색인)

In [650]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [651]:
obj.index=['a','b','c','d']

In [652]:
obj

a    4.5
b    7.2
c   -5.3
d    3.6
dtype: float64

### reindex는 기존 색인-피쳐 관계를 유지 (Series 예시)

In [653]:
obj2=obj.reindex(["a", "c", "d", "b", "e"])
obj2

a    4.5
c   -5.3
d    3.6
b    7.2
e    NaN
dtype: float64

In [657]:
obj

a    4.5
b    7.2
c   -5.3
d    3.6
dtype: float64

In [59]:
obj3 = Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [60]:
obj3.reindex(np.arange(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [61]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [62]:
obj3.reindex(np.arange(6), method="bfill")

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [63]:
obj3.reindex(np.arange(6), fill_value=777)

0      blue
1       777
2    purple
3       777
4    yellow
5       777
dtype: object

### DataFrame에서의 재색인

In [662]:
frame = DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [663]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [664]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### axis="columns" 와 axis="index" 적용이 가능 (각각 1 혹은 0도 적용가능)  (reindex외의 다른 메소드에서도 같은 방식으로 적용 됨)

In [669]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [670]:
frame.reindex(states, axis=1)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

## 6. 행이나 열 삭제하기 (drop)

In [64]:
obj = Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [66]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [67]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

### DataFrame에서 drop

### index나 columns를 선택적으로 drop 가능

In [68]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [71]:
data.drop(["two", "four"], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [72]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## 15. Series 색인

### 넘파이 배열처럼 괄호를 통해서 색인 가능

### 괄호 index 순서나 index 레이블을 입력하여 호출

In [73]:
obj = Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [81]:
obj[0]

(0.0, 0.0)

In [83]:
obj["a"]

0.0

In [80]:
obj[["d","b"]]

d    3.0
b    1.0
dtype: float64

In [77]:
obj[[3,1]]

d    3.0
b    1.0
dtype: float64

In [78]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

### 정수 색인과 정수인 색인 사이의 혼란

In [88]:
obj = Series(np.arange(4.), index=["a", 2, 1, 0])
obj

a    0.0
2    1.0
1    2.0
0    3.0
dtype: float64

In [91]:
obj[0]

3.0

In [90]:
obj[3]

KeyError: 3

### loc과 iloc

In [94]:
obj

a    0.0
2    1.0
1    2.0
0    3.0
dtype: float64

In [92]:
obj.loc

In [93]:
obj.iloc

In [98]:
obj.loc["a"],obj.loc[2],obj.loc[1],obj.loc[0]

(0.0, 1.0, 2.0, 3.0)

In [99]:
obj.iloc[0],obj.iloc[1],obj.iloc[2],obj.iloc[3]

(0.0, 1.0, 2.0, 3.0)

## 8. DataFrame 색인

### 기본 색인 방법

In [723]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [101]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [106]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [107]:
data[[1,2]]

KeyError: "None of [Index([1, 2], dtype='int32')] are in the [columns]"

In [728]:
data[2]

KeyError: 2

In [108]:
data[:,:]

InvalidIndexError: (slice(None, None, None), slice(None, None, None))

### DataFrame의 loc, iloc 속성

### loc과 iloc 적용시 넘파이 2차원 배열처럼 접근가능

In [109]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

In [110]:
data.loc["Colorado"]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [111]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [112]:
data.loc[["Colorado", "New York"], ["two", "three"]]

          two  three
Colorado    5      6
New York   13     14

In [113]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [114]:
data.iloc[1:2]

          one  two  three  four
Colorado    4    5      6     7

In [115]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [116]:
data.iloc[:,1]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [754]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    4    5      6     7

In [118]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [117]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [403]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

#### 레이블의 슬라이싱은 레이블도 포함

In [405]:
data.loc[:"Utah", "two"]

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [406]:
data.iloc[:, :3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [414]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [120]:
data.loc[data.three > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [119]:
data.iloc[data.three > 5]

ValueError: iLocation based boolean indexing cannot use an indexable as a mask

## 9. 산술연산과 데이터정렬

In [418]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [419]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [420]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [421]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [422]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [423]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [424]:
df1 = DataFrame({"A": [1, 2]})
df2 = DataFrame({"B": [3, 4]})
df1

   A
0  1
1  2

In [425]:
df2

   B
0  3
1  4

In [426]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [129]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [130]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [131]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [132]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [127]:
df1.sub(df2,fill_value=100)

      a     b     c     d     e
0   0.0   0.0   0.0   0.0  96.0
1  -1.0 -95.0  -1.0  -1.0  91.0
2  -2.0  -2.0  -2.0  -2.0  86.0
3  85.0  84.0  83.0  82.0  81.0

In [128]:
df1.rsub(df2,fill_value=100)

      a     b     c     d     e
0   0.0   0.0   0.0   0.0 -96.0
1   1.0  95.0   1.0   1.0 -91.0
2   2.0   2.0   2.0   2.0 -86.0
3 -85.0 -84.0 -83.0 -82.0 -81.0

In [431]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [133]:
df1.div(1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [432]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

## 11. DataFrame과 Series 간의 연산

In [763]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [764]:
arr[0]

array([0., 1., 2., 3.])

In [765]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [766]:
frame = DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]

In [767]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [768]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [769]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [770]:
series2 = Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [771]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [772]:
series3 = frame["d"]
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [773]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [774]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [775]:
frame.sub(series,axis="index")

         b   d   e
Ohio   NaN NaN NaN
Oregon NaN NaN NaN
Texas  NaN NaN NaN
Utah   NaN NaN NaN
b      NaN NaN NaN
d      NaN NaN NaN
e      NaN NaN NaN

In [776]:
frame.sub(series,axis="columns")

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [777]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## 12. 함수 적용과 맵핑

In [134]:
frame = DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -0.025902  0.249978  0.422625
Ohio   -0.504132  1.340144  0.875086
Texas  -2.668343 -0.292764 -0.255447
Oregon -0.590341  0.226787 -1.341872

In [475]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [154]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    2.642440
d    1.632908
e    2.216958
dtype: float64

In [478]:
frame.apply(lambda x:x.max()-x.min())

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [480]:
frame.apply(f1,axis="index")

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [479]:
frame.apply(f1, axis="columns")

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [778]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [484]:
def f2(x):
    return Series([x.min(), x.max()], index=["min", "max"])
type(frame.apply(f2))
frame.apply(f2)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [144]:
S1=frame["b"]
S1

Utah     -0.025902
Ohio     -0.504132
Texas    -2.668343
Oregon   -0.590341
Name: b, dtype: float64

In [145]:
S1.map(lambda x:2*x)

Utah     -0.051805
Ohio     -1.008264
Texas    -5.336685
Oregon   -1.180682
Name: b, dtype: float64

In [147]:
frame

               b         d         e
Utah   -0.025902  0.249978  0.422625
Ohio   -0.504132  1.340144  0.875086
Texas  -2.668343 -0.292764 -0.255447
Oregon -0.590341  0.226787 -1.341872

In [146]:
frame.applymap(lambda x:2*x)

               b         d         e
Utah   -0.051805  0.499955  0.845251
Ohio   -1.008264  2.680288  1.750172
Texas  -5.336685 -0.585527 -0.510893
Oregon -1.180682  0.453574 -2.683744

## 13. 정렬과 순위

### sort_index

In [485]:
obj = Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [486]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [161]:
obj

a    0.0
2    1.0
1    2.0
0    3.0
dtype: float64

In [487]:
frame = DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [488]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [489]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [490]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### sort_values

In [491]:
obj = Series([4, 7, -3, 2])

In [492]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [493]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [495]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

### DataFrame의 sort_values

In [496]:
frame = DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [497]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [498]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### rank

In [162]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [165]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [501]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [502]:
frame = DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [503]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## 14. 넘파이 기반 함수/메서드 제공

In [166]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [782]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [787]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [788]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [789]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [790]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [791]:
df.idxmax()

one    b
two    d
dtype: object

In [792]:
df.idxmax(axis="columns")

a    one
b    one
c    NaN
d    one
dtype: object

In [793]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [794]:
df.cumsum(axis=0)

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [795]:
df.cumsum(axis=1)

    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [796]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [797]:
obj = Series(["a", "a", "b", "c"] * 4)

In [798]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [799]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 15. 상관관계와 공분산

In [800]:
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [801]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [802]:
type(price)

pandas.core.frame.DataFrame

In [803]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [558]:
returns = price.pct_change()

In [559]:
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [560]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [561]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [562]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [563]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [564]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [565]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [566]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64